Обработки/Reports/_РасчетнаяСтоимостьПаяИСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетнаяСтоимостьПаяИСЧА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьШапку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОтчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетнаяСтоимостьПаяИСЧА/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
		
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	Отчет.СчетДоверительногоУправления = "";
	ОпределитьКаталогВыгрузки();
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОчистка(Элемент, СтандартнаяОбработка)
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Структура = Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант);
	Подписант = РаботаСОтчетами.ПолучитьКонтактноеЛицо(Структура);

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	Отчет.Период = ЭтаФорма.НастройкиОтчета.Период.ДатаОкончания;
	
	ЭтаФорма.Подписант = ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", ЭтаФорма.НастройкиОтчета.Подписант);
	
	СкомпоноватьРезультат();
	
	Если ЭтаФорма.Результат.ВысотаТаблицы < 5 Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПаевойИнвестиционныйФондНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ПолучитьСписокПИФДляВыбора(Отчет.Период, Отчет.Организация);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПИФДляВыбора(Дата, Организация)
	
	Результат = Новый СписокЗначений;
	
	МассивПИФ = Справочники.УправляющиеКомпании.ПолучитьПИФыПоЮрФизЛицуУправляющейКомпании(Дата, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮрФизЛицо"));
	
	Для Каждого ТекПИФ Из МассивПИФ Цикл
		Результат.Добавить(ТекПИФ);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОпределитьКаталогВыгрузки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
	|			&Период,
	|			ВЫБОР
	|				КОГДА &СчетДоверительногоУправления = ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.)
	|					ТОГДА (ВЫРАЗИТЬ(Клиент КАК Справочник.ПаевыеИнвестиционныеФонды)) = &ПаевойИнвестиционныйФонд
	|				ИНАЧЕ СчетДоверительногоУправления = &СчетДоверительногоУправления
	|			КОНЕЦ) КАК КлиентыДоверительногоУправленияСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", 						КонецДня(Отчет.Период));
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", 		Отчет.ПаевойИнвестиционныйФонд);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	Отчет.СчетДоверительногоУправления);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отчет.СчетДоверительногоУправления = Выборка.СчетДоверительногоУправления;
	КонецЕсли;
		
КонецПроцедуры // ОпределитьКаталогВыгрузки()

&НаКлиенте
Процедура КаталогДанныхОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Отчет.КаталогДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		
	ПутьКФайлу = Отчет.КаталогДанных;
	
	// Если в пути не содержится указание на файл, ничего не делаем
	НомерПозиции = СтрНайти(НРег(ПутьКФайлу), ".xls", НаправлениеПоиска.СКонца);
	
	ТекИмяФайла = "";
	ТекКаталог  = ПутьКФайлу;
	Если НомерПозиции > 0 Тогда                             	
		НомерПозиции = СтрНайти(ПутьКФайлу, "\", НаправлениеПоиска.СКонца);
				
		Если НомерПозиции > 0 Тогда
			ТекИмяФайла = Сред(ПутьКФайлу, НомерПозиции);
			ТекКаталог	= Лев(ПутьКФайлу, НомерПозиции - 1);
		КонецЕсли;                                          		
	КонецЕсли;	
	
	Диалог.Каталог            = ТекКаталог; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок          = "Выберите каталог"; 
	
	Если Диалог.Выбрать() Тогда           			
		ТекИмяФайла = Диалог.Каталог + ТекИмяФайла;
		
		НомерПозиции = СтрНайти(НРег(ТекИмяФайла), ".xls", НаправлениеПоиска.СКонца);	
		Если НомерПозиции = 0 Тогда                             	
			//Дополняем именем файла
			СокрИмяПИФ = СократитьНазваниеПИФ(СокрЛП(Отчет.ПаевойИнвестиционныйФонд));
			ТекИмяФайла = ТекИмяФайла + "\" + "Стоимость пая и СЧА " + СокрИмяПИФ + " " + Формат(Отчет.Период, "ДФ=yyyyMMdd") + ".xlsx";	
        КонецЕсли;
		
		Отчет.КаталогДанных = ТекИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция СократитьНазваниеПИФ(СтрПИФ)
	
	Если СтрПИФ = "" Тогда
		Возврат СтрПИФ;
	КонецЕсли;
	
	Кавычки = Прав(СтрПИФ, 1);
	
	СтрПИФ = СтрЗаменить(СтрПИФ, Кавычки, "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " комбинированный", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " смешанных инвестиций", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " рыночных финансовых инструментов", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " долгосрочных прямых инвестиций", "");
	СтрПИФ = СтрЗаменить(СтрПИФ, " прямых инвестиций", "");
	
	Возврат СтрПИФ;
	
КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры
